#region Task 1
# month = int(input("Введите номер месяца (от 1 до 12): "))

# match month:
#     case 12 | 1 | 2:
#         season = "зима"
#     case 3 | 4 | 5:
#         season = "весна"
#     case 6 | 7 | 8:
#         season = "лето"
#     case 9 | 10 | 11:
#         season = "осень"
#     case _:
#         season = "неизвестный месяц"

# print(f"Введенный месяц соответствует времени года: {season}")
#endregion

#region Task 2
# Напишите программу, которая запрашивает у пользователя вес товара и расстояние до места доставки, а затем определяет стоимость доставки на основе следующих правил:

# Если вес товара меньше 10 кг и расстояние менее 100 км, стоимость доставки составляет 1000 рублей.
# В противном случае, стоимость доставки составляет 1500 рублей.
# Инструкция:

# Запросите у пользователя ввод веса товара и расстояния с помощью input().
# Преобразуйте введенные значения в числа с помощью float().
# Используйте условную конструкцию для определения стоимости доставки на основе правил выше.
# Выведите стоимость доставки.

# ProductWeight = int(input("Введите вес товара: "))
# Range = int(input("Введите расстояние до места доставки: "))
# DeliveryCost = 1000 if ProductWeight < 10 and Range < 100 else 1500

# print(f"Стоимость доставки = {DeliveryCost}")
#endregion

#region Task 3
# Напишите программу, которая запрашивает у пользователя его имя и определяет, короткое оно (меньше 5 символов), средней длины (5-10 символов) или длинное (больше 10 символов).

# UserName = input("Введите ваше имя: ")
# NameLength = len(UserName)

# match NameLength:
#     case NameLength if NameLength < 5 :
#         NameType = "короткое"
#     case NameLength if  5 <= NameLength <= 10:
#         NameType = "среднее"
#     case NameLength if NameLength > 10 :
#         NameType = "длинное"

# print(f"Ваше имя {NameType}.")
#endregion

#region Task 4

# Напишите программу, которая запрашивает у пользователя число от 1 до 7 и выводит соответствующий день недели.

# Инструкция:

# Запросите у пользователя ввод числа с помощью input().
# Преобразуйте введенное значение в число с помощью int().
# Используйте конструкцию if, elif и else для определения дня недели, соответствующего введенному числу.
# Выведите день недели.

# DayNumber = int(input("Введите число от 1 до 7: "))

# if DayNumber == 1:
#     DayName = "Понедельник"
# elif DayNumber == 2:
#     DayName = "Вторник"
# elif DayNumber == 3:
#     DayName = "Среда"
# elif DayNumber == 4:
#     DayName = "Четверг"
# elif DayNumber == 5:
#     DayName = "Пятница"
# elif DayNumber == 6:
#     DayName = "Суббота"
# elif DayNumber == 7:
#     DayName = "Воскресенье"
# else: DayName = "... mmphm ...error ... Опс, кажется наша земная система не приспособлена к вашему счету."

# print(f"Ваше число {DayNumber} это {DayName}.")

# DaysWeek = {
#     1: "Понедельник",
#     2: "Вторник",
#     3: "Среда",
#     4: "Четверг",
#     5: "Пятница",
#     6: "Суббота",
#     7: "Воскресенье"
# }  

# print(DaysWeek.get(DayNumber, "Неверный ввод! Введите число от 1 до 7."))

#endregion

#region Task 5

# Задача: Напишите программу, которая запрашивает у пользователя три оценки (от 0 до 100) и выводит средний балл.

# Инструкция:

# Запросите у пользователя ввод трех оценок с помощью input().
# Преобразуйте введенные значения в числа с помощью int().
# Вычислите средний балл, сложив все оценки и разделив на 3.
# Используйте условную конструкцию для определения, является ли средний балл "плохим" (меньше 60), "хорошим" (60-89), или "отличным" (90-100).

# value1 = int(input("Введите первую оценку от 0 до 100: "))
# value2 = int(input("Введите вторую оценку от 0 до 100: "))
# value3 = int(input("Введите третью оценку от 0 до 100: "))

# if (value1 < 0 or value1 > 100) or (value2 < 0 or value2 > 100) or (value3 < 0 or value3 > 100):
#     print("Неправильный ввод, одно из чисел находится за пределами от 0 до 100")
# else:
#     averageValue = (value1 + value2 + value3) / 3 

#     if averageValue < 60:
#         valueType = "плохая"
#     if averageValue >= 60 and averageValue < 90:
#         valueType = "хорошая"
#     if averageValue >= 90 and averageValue <= 100:
#         valueType = "хорошая"

#     print(f"Ваша оценка {averageValue} - {valueType}.")

#endregion

#region Task 6

# Задача: Напишите программу, которая запрашивает у пользователя текущее время в часах (от 0 до 23) и определяет, в какую часть дня оно попадает: утро, день, вечер или ночь.

# Инструкция:

# Запросите у пользователя ввод текущего времени в часах с помощью input().
# Преобразуйте введенное значение в число с помощью int().
# Используйте условные конструкции для определения части дня на основе времени. Например, если время меньше 12, то это утро, если от 12 до 17 - день и так далее.
# Выведите часть дня

# time = int(input("Введите время в часах от 0 до 23: "))

# if time >= 4 and time < 12 :
#     print("Утро")
# elif time >= 12 and time < 17:
#     print("День")
# elif time >= 17 and time < 22:
#     print("Вечер")
# elif (time >= 22 and time <= 23) or (time < 4 and time >= 0) :
#     print("Ночь")
# else:
#     print("Что, что ?")
#endregion

#region Task 7

# Задача: Напишите программу, которая находит наибольшее из трех введенных пользователем чисел.

# Инструкция:

# Запросите у пользователя ввод трех чисел с помощью input().
# Преобразуйте введенные значения в числа с помощью int().
# Используйте условные конструкции (if, elif, else) для сравнения трех чисел и определения наибольшего.
# Выведите наибольшее число.

# value1 = int(input("Введите первое число: "))
# value2 = int(input("Введите второе число: "))
# value3 = int(input("Введите третье число: "))

# if value1 >= value2 and value1 >= value3:
#     maxValue = value1
# elif value2 >= value1 and value2 >= value3:
#     maxValue = value2
# else:
#     maxValue = value3

# print(f"{maxValue}")

#endregion
